In [86]:
import pandas as pd

In [87]:
produtos = pd.read_csv("../data/produtos.csv", sep=";")
produtos

,IdProduto,DescNomeProduto,DescDescricaoProduto,DescCategoriaProduto
0,001 - Espada Longa,Espada Longa,Uma espada longa de aço.,espada
1,002 - Espada Curta,Espada Curta,Espada leve e rápida.,espada
2,003 - Armadura de Couro,Armadura de Couro,Armadura leve feita de couro.,armadura
3,004 - Armadura de Placas,Armadura de Placas,Armadura pesada de placas metálicas.,armadura
4,005 - Botas de Agilidade,Botas de Agilidade,Botas que aumentam a destreza.,botas
...,...,...,...,...
113,5,ChatMessage,NaN,chat
114,6,Churn_10pp,NaN,churn_model
115,7,Churn_2pp,NaN,churn_model
116,8,Churn_5pp,NaN,churn_model
117,9,Coca Cola,NaN,food

In [88]:
produtos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118 entries, 0 to 117
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   IdProduto             118 non-null    object
 1   DescNomeProduto       118 non-null    object
 2   DescDescricaoProduto  77 non-null     object
 3   DescCategoriaProduto  118 non-null    object
dtypes: object(4)
memory usage: 3.8+ KB

In [89]:
produtos.dropna()

,IdProduto,DescNomeProduto,DescDescricaoProduto,DescCategoriaProduto
0,001 - Espada Longa,Espada Longa,Uma espada longa de aço.,espada
1,002 - Espada Curta,Espada Curta,Espada leve e rápida.,espada
2,003 - Armadura de Couro,Armadura de Couro,Armadura leve feita de couro.,armadura
3,004 - Armadura de Placas,Armadura de Placas,Armadura pesada de placas metálicas.,armadura
4,005 - Botas de Agilidade,Botas de Agilidade,Botas que aumentam a destreza.,botas
...,...,...,...,...
72,073 - Adaga de Gelo,Adaga de Gelo,Adaga que congela inimigos.,adaga
73,074 - Adaga do Eclipse,Adaga do Eclipse,Adaga que invoca escuridão.,adaga
74,075 - Adaga do Relâmpago,Adaga do Relâmpago,Adaga que emite descargas elétricas.,adaga
75,076 - Adaga do Cosmos,Adaga do Cosmos,Adaga que manipula energia cósmica.,adaga
76,077 - Adaga do Apocalipse,Adaga do Apocalipse,Adaga lendária que destrói tudo em seu caminho.,adaga

In [90]:
produtos.dropna().info()

<class 'pandas.core.frame.DataFrame'>
Index: 77 entries, 0 to 76
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   IdProduto             77 non-null     object
 1   DescNomeProduto       77 non-null     object
 2   DescDescricaoProduto  77 non-null     object
 3   DescCategoriaProduto  77 non-null     object
dtypes: object(4)
memory usage: 3.0+ KB

In [91]:
produtos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118 entries, 0 to 117
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   IdProduto             118 non-null    object
 1   DescNomeProduto       118 non-null    object
 2   DescDescricaoProduto  77 non-null     object
 3   DescCategoriaProduto  118 non-null    object
dtypes: object(4)
memory usage: 3.8+ KB

In [92]:
produtos.dropna(how="any")

,IdProduto,DescNomeProduto,DescDescricaoProduto,DescCategoriaProduto
0,001 - Espada Longa,Espada Longa,Uma espada longa de aço.,espada
1,002 - Espada Curta,Espada Curta,Espada leve e rápida.,espada
2,003 - Armadura de Couro,Armadura de Couro,Armadura leve feita de couro.,armadura
3,004 - Armadura de Placas,Armadura de Placas,Armadura pesada de placas metálicas.,armadura
4,005 - Botas de Agilidade,Botas de Agilidade,Botas que aumentam a destreza.,botas
...,...,...,...,...
72,073 - Adaga de Gelo,Adaga de Gelo,Adaga que congela inimigos.,adaga
73,074 - Adaga do Eclipse,Adaga do Eclipse,Adaga que invoca escuridão.,adaga
74,075 - Adaga do Relâmpago,Adaga do Relâmpago,Adaga que emite descargas elétricas.,adaga
75,076 - Adaga do Cosmos,Adaga do Cosmos,Adaga que manipula energia cósmica.,adaga
76,077 - Adaga do Apocalipse,Adaga do Apocalipse,Adaga lendária que destrói tudo em seu caminho.,adaga

In [93]:
df = pd.DataFrame(
    {
        "nome": ["Jailton", None, "Carol", "Luisa", "Arthur"],
        "idade": [27, None, None, 2, 9],
        "salario": [2500, 1500, 2600, None, None]
    }
)
df

      nome  idade  salario
0  Jailton   27.0   2500.0
1     None    NaN   1500.0
2    Carol    NaN   2600.0
3    Luisa    2.0      NaN
4   Arthur    9.0      NaN

In [94]:
df.dropna(how="all")

      nome  idade  salario
0  Jailton   27.0   2500.0
1     None    NaN   1500.0
2    Carol    NaN   2600.0
3    Luisa    2.0      NaN
4   Arthur    9.0      NaN

In [95]:
df.dropna(how="any",subset=["idade", "nome"])

      nome  idade  salario
0  Jailton   27.0   2500.0
3    Luisa    2.0      NaN
4   Arthur    9.0      NaN

In [96]:
medias = df[["idade", "salario"]].mean()

In [97]:
df["idade"].fillna(0)

0    27.0
1     0.0
2     0.0
3     2.0
4     9.0
Name: idade, dtype: float64

In [98]:
df.fillna({"nome": "alguem", "idade": 0})

      nome  idade  salario
0  Jailton   27.0   2500.0
1   alguem    0.0   1500.0
2    Carol    0.0   2600.0
3    Luisa    2.0      NaN
4   Arthur    9.0      NaN

In [99]:
df.fillna(medias)

      nome      idade  salario
0  Jailton  27.000000   2500.0
1     None  12.666667   1500.0
2    Carol  12.666667   2600.0
3    Luisa   2.000000   2200.0
4   Arthur   9.000000   2200.0